//
// Created by biao on 24-9-14.
//

#include "rl_quadruped_controller/control/Estimator.h"

#include <controller_common/CtrlInterfaces.h>
#include <controller_common/common/mathTools.h>

#include "rl_quadruped_controller/control/CtrlComponent.h"

// 估计器构造函数，初始化估计器参数
Estimator::Estimator(CtrlInterfaces& ctrl_interfaces, CtrlComponent& ctrl_component, int feet_force_threshold) :
    ctrl_interfaces_(ctrl_interfaces),
    robot_model_(ctrl_component.robot_model_),
    feet_force_threshold_(feet_force_threshold)
{
    // 重力加速度向量
    g_ << 0, 0, -9.81;
    dt_ = 1.0 / ctrl_interfaces_.frequency_;
    std::cout << "dt: " << dt_ << std::endl;

    // 初始化较大方差，用于估计
    large_variance_ = 100;

    // 初始化Qdig矩阵，Qdig的前六个元素设置为较小值，后面设置较大值
    for (int i(0); i < Qdig.rows(); ++i)
    {
        Qdig(i) = i < 6 ? 0.0003 : 0.01;
    }

    // 初始化状态估计变量
    x_hat_.setZero();
    u_.setZero();

    // 状态转移矩阵A初始化
    A.setZero();
    A.block(0, 0, 3, 3) = I3;
    A.block(0, 3, 3, 3) = I3 * dt_;
    A.block(3, 3, 3, 3) = I3;
    A.block(6, 6, 12, 12) = I12;

    // 控制输入矩阵B初始化
    B.setZero();
    B.block(3, 0, 3, 3) = I3 * dt_;

    // 观测矩阵C初始化
    C.setZero();
    C.block(0, 0, 3, 3) = -I3;
    C.block(3, 0, 3, 3) = -I3;
    C.block(6, 0, 3, 3) = -I3;
    C.block(9, 0, 3, 3) = -I3;
    C.block(12, 3, 3, 3) = -I3;
    C.block(15, 3, 3, 3) = -I3;
    C.block(18, 3, 3, 3) = -I3;
    C.block(21, 3, 3, 3) = -I3;
    C.block(0, 6, 12, 12) = I12;
    C(24, 8) = 1;
    C(25, 11) = 1;
    C(26, 14) = 1;
    C(27, 17) = 1;

    // 初始化协方差矩阵P为单位矩阵，乘以较大方差
    P.setIdentity();
    P = large_variance_ * P;

    // 初始化RInit_矩阵
    RInit_ << 0.008, 0.012, -0.000, -0.009, 0.012, 0.000, 0.009, -0.009, -0.000,
        -0.009, -0.009, 0.000, -0.000, 0.000, -0.000, 0.000, -0.000, -0.001,
        -0.002, 0.000, -0.000, -0.003, -0.000, -0.001, 0.000, 0.000, 0.000, 0.000,
        0.012, 0.019, -0.001, -0.014, 0.018, -0.000, 0.014, -0.013, -0.000,
        -0.014, -0.014, 0.001, -0.001, 0.001, -0.001, 0.000, 0.000, -0.001,
        -0.003, 0.000, -0.001, -0.004, -0.000, -0.001, 0.000, 0.000, 0.000, 0.000,
        -0.000, -0.001, 0.001, 0.001, -0.001, 0.000, -0.000, 0.000, -0.000, 0.001,
        0.000, -0.000, 0.000, -0.000, 0.000, 0.000, -0.000, -0.000, 0.000, -0.000,
        -0.000, -0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, -0.009, -0.014,
        0.001, 0.010, -0.013, 0.000, -0.010, 0.010, 0.000, 0.010, 0.010, -0.000,
        0.001, 0.000, 0.000, 0.001, -0.000, 0.001, 0.002, -0.000, 0.000, 0.003,
        0.000, 0.001, 0.000, 0.000, 0.000, 0.000, 0.012, 0.018, -0.001, -0.013,
        0.018, -0.000, 0.013, -0.013, -0.000, -0.013, -0.013, 0.001, -0.001,
        0.000, -0.001, 0.000, 0.001, -0.001, -0.003, 0.000, -0.001, -0.004,
        -0.000, -0.001, 0.000, 0.000, 0.000, 0.000, 0.000, -0.000, 0.000, 0.000,
        -0.000, 0.001, 0.000, 0.000, -0.000, 0.000, 0.000, -0.000, -0.000, 0.000,
        -0.000, 0.000, 0.000, 0.000, -0.000, -0.000, -0.000, -0.000, 0.000, 0.000,
        0.000, 0.000, 0.000, 0.000, 0.009, 0.014, -0.000, -0.010, 0.013, 0.000,
        0.010, -0.010, -0.000, -0.010, -0.010, 0.000, -0.001, 0.000, -0.001,
        0.000, -0.000, -0.001, -0.001, 0.000, -0.000, -0.003, -0.000, -0.001,
        0.000, 0.000, 0.000, 0.000, -0.009, -0.013, 0.000, 0.010, -0.013, 0.000,
        -0.010, 0.009, 0.000, 0.010, 0.010, -0.000, 0.001, -0.000, 0.000, -0.000,
        0.000, 0.001, 0.002, 0.000, 0.000, 0.003, 0.000, 0.001, 0.000, 0.000,
        0.000, 0.000, -0.000, -0.000, -0.000, 0.000, -0.000, -0.000, -0.000,
        0.000, 0.001, 0.000, 0.000, 0.000, 0.000, -0.000, 0.000, -0.000, 0.000,
        -0.000, 0.000, -0.000, 0.000, 0.000, -0.000, -0.000, 0.000, 0.000, 0.000,
        0.000, -0.009, -0.014, 0.001, 0.010, -0.013, 0.000, -0.010, 0.010, 0.000,
        0.010, 0.010, -0.000, 0.001, 0.000, 0.000, -0.000, -0.000, 0.001, 0.002,
        -0.000, 0.000, 0.003, 0.000, 0.001, 0.000, 0.000, 0.000, 0.000, -0.009,
        -0.014, 0.000, 0.010, -0.013, 0.000, -0.010, 0.010, 0.000, 0.010, 0.010,
        -0.000, 0.001, -0.000, 0.000, -0.000, 0.000, 0.001, 0.002, -0.000, 0.000,
        0.003, 0.001, 0.001, 0.000, 0.000, 0.000, 0.000, 0.000, 0.001, -0.000,
        -0.000, 0.001, -0.000, 0.000, -0.000, 0.000, -0.000, -0.000, 0.001, 0.000,
        -0.000, -0.000, -0.000, 0.000, 0.000, -0.000, 0.000, 0.000, 0.000, 0.000,
        0.000, 0.000, 0.000, 0.000, 0.000, -0.000, -0.001, 0.000, 0.001, -0.001,
        -0.000, -0.001, 0.001, 0.000, 0.001, 0.001, 0.000, 1.708, 0.048, 0.784,
        0.062, 0.042, 0.053, 0.077, 0.001, -0.061, 0.046, -0.019, -0.029, 0.000,
        0.000, 0.000, 0.000, 0.000, 0.001, -0.000, 0.000, 0.000, 0.000, 0.000,
        -0.000, -0.000, 0.000, -0.000, -0.000, 0.048, 5.001, -1.631, -0.036,
        0.144, 0.040, 0.036, 0.016, -0.051, -0.067, -0.024, -0.005, 0.000, 0.000,
        0.000, 0.000, -0.000, -0.001, 0.000, 0.000, -0.001, -0.000, -0.001, 0.000,
        0.000, 0.000, 0.000, -0.000, 0.784, -1.631, 1.242, 0.057, -0.037, 0.018,
        0.034, -0.017, -0.015, 0.058, -0.021, -0.029, 0.000, 0.000, 0.000, 0.000,
        0.000, 0.000, 0.000, 0.001, 0.000, 0.000, 0.000, -0.000, -0.000, -0.000,
        -0.000, -0.000, 0.062, -0.036, 0.057, 6.228, -0.014, 0.932, 0.059, 0.053,
        -0.069, 0.148, 0.015, -0.031, 0.000, 0.000, 0.000, 0.000, -0.000, 0.000,
        -0.000, -0.000, 0.001, 0.000, -0.000, 0.000, 0.000, -0.000, 0.000, 0.000,
        0.042, 0.144, -0.037, -0.014, 3.011, 0.986, 0.076, 0.030, -0.052, -0.027,
        0.057, 0.051, 0.000, 0.000, 0.000, 0.000, -0.001, -0.001, -0.000, 0.001,
        -0.001, 0.000, -0.001, 0.001, -0.000, 0.001, 0.001, 0.000, 0.053, 0.040,
        0.018, 0.932, 0.986, 0.885, 0.090, 0.044, -0.055, 0.057, 0.051, -0.003,
        0.000, 0.000, 0.000, 0.000, -0.002, -0.003, 0.000, 0.002, -0.003, -0.000,
        -0.001, 0.002, 0.000, 0.002, 0.002, -0.000, 0.077, 0.036, 0.034, 0.059,
        0.076, 0.090, 6.230, 0.139, 0.763, 0.013, -0.019, -0.024, 0.000, 0.000,
        0.000, 0.000, 0.000, 0.000, -0.000, -0.000, 0.000, -0.000, 0.000, 0.000,
        -0.000, -0.000, -0.000, 0.000, 0.001, 0.016, -0.017, 0.053, 0.030, 0.044,
        0.139, 3.130, -1.128, -0.010, 0.131, 0.018, 0.000, 0.000, 0.000, 0.000,
        -0.000, -0.001, -0.000, 0.000, -0.001, -0.000, -0.000, 0.000, 0.000,
        0.000, 0.000, 0.000, -0.061, -0.051, -0.015, -0.069, -0.052, -0.055,
        0.763, -1.128, 0.866, -0.022, -0.053, 0.007, 0.000, 0.000, 0.000, 0.000,
        -0.003, -0.004, -0.000, 0.003, -0.004, -0.000, -0.003, 0.003, 0.000,
        0.003, 0.003, 0.000, 0.046, -0.067, 0.058, 0.148, -0.027, 0.057, 0.013,
        -0.010, -0.022, 2.437, -0.102, 0.938, 0.000, 0.000, 0.000, 0.000, -0.000,
        -0.000, 0.000, 0.000, -0.000, 0.000, -0.000, 0.000, -0.000, 0.000, 0.001,
        0.000, -0.019, -0.024, -0.021, 0.015, 0.057, 0.051, -0.019, 0.131, -0.053,
        -0.102, 4.944, 1.724, 0.000, 0.000, 0.000, 0.000, -0.001, -0.001, 0.000,
        0.001, -0.001, 0.000, -0.001, 0.001, -0.000, 0.001, 0.001, 0.000, -0.029,
        -0.005, -0.029, -0.031, 0.051, -0.003, -0.024, 0.018, 0.007, 0.938, 1.724,
        1.569, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000,
        0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000,
        0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 1.0, 0.000,
        0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000,
        0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000,
        0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 1.0, 0.000, 0.000, 0.000,
        0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000,
        0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000,
        0.000, 0.000, 0.000, 0.000, 0.000, 1.0, 0.000, 0.000, 0.000, 0.000, 0.000,
        0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000,
        0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000,
        0.000, 0.000, 0.000, 1.0;

    // 初始化Cu矩阵
    Cu << 268.573, -43.819, -147.211, -43.819, 92.949, 58.082, -147.211, 58.082,
        302.120;

    // 初始化QInit_矩阵
    QInit_ = Qdig.asDiagonal();
    QInit_ += B * Cu * B.transpose();

    // 初始化低通滤波器（已注释）
    // low_pass_filters_.resize(3);
    // low_pass_filters_[0] = std::make_shared<LowPassFilter>(dt_, 3.0);
    // low_pass_filters_[1] = std::make_shared<LowPassFilter>(dt_, 3.0);
    // low_pass_filters_[2] = std::make_shared<LowPassFilter>(dt_, 3.0);
}

// 获取当前的偏航角
double Estimator::getYaw() const
{
    return rotMatToRPY(rotation_)(2);
}

// 更新估计器的状态
void Estimator::update()
{
    if (robot_model_->mass_ == 0) return;

    // 初始化Q和R矩阵
    Q = QInit_;
    R = RInit_;

    // 获取机器人的足端位置和速度
    foot_poses_ = robot_model_->getFeet2BPositions();
    foot_vels_ = robot_model_->getFeet2BVelocities();
    feet_h_.setZero();

    // 根据足部接触情况调整协方差
    for (int i(0); i < 4; ++i)
    {
        if (ctrl_interfaces_.foot_force_state_interface_[i].get().get_optional().value() < feet_force_threshold_)
        {
            // 足部未接触
            Q.block(6 + 3 * i, 6 + 3 * i, 3, 3) = large_variance_ * Eigen::MatrixXd::Identity(3, 3);
            R.block(12 + 3 * i, 12 + 3 * i, 3, 3) = large_variance_ * Eigen::MatrixXd::Identity(3, 3);
            R(24 + i, 24 + i) = large_variance_;
        }
        else
        {
            // 足部接触
            const double trust = windowFunc(0.5, 0.2);
            Q.block(6 + 3 * i, 6 + 3 * i, 3, 3) =
                (1 + (1 - trust) * large_variance_) *
                QInit_.block(6 + 3 * i, 6 + 3 * i, 3, 3);
            R.block(12 + 3 * i, 12 + 3 * i, 3, 3) =
                (1 + (1 - trust) * large_variance_) *
                RInit_.block(12 + 3 * i, 12 + 3 * i, 3, 3);
            R(24 + i, 24 + i) =
                (1 + (1 - trust) * large_variance_) * RInit_(24 + i, 24 + i);
        }
        feet_pos_body_.segment(3 * i, 3) = Vec3(foot_poses_[i].p.data);
        feet_vel_body_.segment(3 * i, 3) = Vec3(foot_vels_[i].data);
    }

    // 更新IMU的数据
    Quat quat;
    quat << ctrl_interfaces_.imu_state_interface_[0].get().get_optional().value(),
        ctrl_interfaces_.imu_state_interface_[1].get().get_optional().value(),
        ctrl_interfaces_.imu_state_interface_[2].get().get_optional().value(),
        ctrl_interfaces_.imu_state_interface_[3].get().get_optional().value();
    rotation_ = quatToRotMat(quat);

    gyro_ << ctrl_interfaces_.imu_state_interface_[4].get().get_optional().value(),
        ctrl_interfaces_.imu_state_interface_[5].get().get_optional().value(),
        ctrl_interfaces_.imu_state_interface_[6].get().get_optional().value();

    acceleration_ << ctrl_interfaces_.imu_state_interface_[7].get().get_optional().value(),
        ctrl_interfaces_.imu_state_interface_[8].get().get_optional().value(),
        ctrl_interfaces_.imu_state_interface_[9].get().get_optional().value();

    // 更新状态和测量值
    u_ = rotation_ * acceleration_ + g_;
    x_hat_ = A * x_hat_ + B * u_;
    y_hat_ = C * x_hat_;

    // 更新测量值
    y_ << feet_pos_body_, feet_vel_body_, feet_h_;

    // 更新协方差矩阵
    Ppriori = A * P * A.transpose() + Q;
    S = R + C * Ppriori * C.transpose();
    Slu = S.lu();
    Sy = Slu.solve(y_ - y_hat_);
    Sc = Slu.solve(C);
    SR = Slu.solve(R);
    STC = S.transpose().lu().solve(C);
    IKC = Eigen::MatrixXd::Identity(18, 18) - Ppriori * C.transpose() * Sc;

    // 更新状态和协方差矩阵
    x_hat_ += Ppriori * C.transpose() * Sy;
    P = IKC * Ppriori * IKC.transpose() +
        Ppriori * C.transpose() * SR * STC * Ppriori.transpose();

    // 使用低通滤波器平滑速度（已注释）
    // low_pass_filters_[0]->addValue(x_hat_(3));
    // low_pass_filters_[1]->addValue(x_hat_(4));
    // low_pass_filters_[2]->addValue(x_hat_(5));
    // x_hat_(3) = low_pass_filters_[0]->getValue();
    // x_hat_(4) = low_pass_filters_[1]->getValue();
    // x_hat_(5) = low_pass_filters_[2]->getValue();
}

// 安全检查，确保估计结果在合理范围内
bool Estimator::safety() const
{
    Vec3 rpy = rotMatToRPY(rotation_);
    if (rpy[0] > M_PI_2 or rpy[0] < -M_PI_2)
    {
        return false;
    }
    if (rpy[1] > M_PI_2 or rpy[1] < -M_PI_2)
    {
        return false;
    }
    return true;
}